lst1 = [10, 20, 30, 40, 50, 60, 70, 80, 90]
print(lst1)               # 印出 [10, 20, 30, 40, 50, 60, 70, 80, 90]
print(lst1[0])            # 印出 10 
print(lst1[3])            # 印出 40
print(lst1[2:6])          # 印出 [30, 40, 50, 60]
print(lst1[:6])           # 印出 [10, 20, 30, 40, 50, 60]
print(lst1[0:9])          # 印出 [10, 20, 30, 40, 50, 60, 70, 80, 90]
print(lst1[1:9:2])        # 印出 [20, 40, 60, 80]
print(lst1[1::2])         # 印出 [20, 40, 60, 80]
print(lst1[-1])           # 印出 90
print(lst1[-9])           # 印出 10
print(lst1[-6:-3])        # 印出 [40, 50, 60]
print(lst1[:-2])          # 印出 [10, 20, 30, 40, 50, 60, 70]
print(lst1[10])           # 錯誤，註標超過範圍
